// const parentTree = [
// 	{
// 		id: 1,
// 		parent: null,
// 		name: "xiaoming",
// 	},
// 	{
// 		id: 2,
// 		parent: 1,
// 		name: "小红",
// 	},
// 	{
// 		id: 3,
// 		parent: 1,
// 		name: "小红",
// 	},{
// 		id: 3,
// 		parent: 0,
// 		name: "小红",
// 	},
// ];
// const arrtotree = (arr)=>{
//     let tree = []
//     arr.forEach((e)=>{
//         e.child = arr.filter((v)=>{
//             return e.id == v.parent
//         })
//         if(!e.parent){
//             tree.push(e)
//         }
//     })
//     return tree
// }
// arrtotree(parentTree)
// let tree = [
//     {
//         "id": 1,
//         "parent": null,
//         "name": "xiaoming",
//         "child": [
//             {
//                 "id": 2,
//                 "parent": 1,
//                 "name": "小红",
//                 "child": []
//             },
//             {
//                 "id": 3,
//                 "parent": 1,
//                 "name": "小红",
//                 "child": []
//             }
//         ]
//     },
//     {
//         "id": 4,
//         "parent": 0,
//         "name": "小红",
//         "child":[]
//     }
// ]
// const treetoarr = (tree)=>{
//     let arr = []
//     for(let i =0;i<tree.length;i++){
//         let base = tree[i]
//         if(Array.isArray(base.child) && base.child.length){
//             arr.push(...treetoarr(base.child))
//         }
//         arr.push(tree[i])
//     }
//     return arr
// }
// treetoarr(tree)
const inputData = `
01		隧道工程			2023/12/30	2026/8/14			1.83%		
01001		北岸敞开段（含A匝道围护结构）			2024/11/18	2025/7/23					
01001001		基坑支护			2024/11/18	2025/4/19					
01001001001		钢立柱	1	项	2024/11/28	2024/12/25	27天			未开工，可控	
01001001006		高压旋喷桩（地连墙槽壁加固）	7193.9	m	2024/11/18	2025/4/12	145天			未开工，可控	
01001001003		地下连续墙	3269.92	m3	2024/12/21	2025/2/16	57天			未开工，可控	
01001001004		喷射混凝土	441.11	m2	2025/3/6	2025/4/19	44天			未开工，可控	
01001001002		钢筋混凝土支撑	1	项	2025/3/6	2025/4/19	44天			未开工，可控	
01001001005		高压旋喷桩止水帷幕	558.04	m	2024/11/18	2025/2/13	87天			未开工，可控	
01001002		主体结构混凝土	170	m	2025/3/1	2025/7/23	144天			未开工，可控	
01009		南岸C匝道敞开			2025/2/10	2025/12/23					
01009002		主体结构混凝土	120	m	2025/7/7	2025/12/23	169天			未开工，可控	
01009001		基坑支护			2025/2/10	2025/9/4					
01009001005		型钢桩	645.03	t	2025/2/10	2025/4/10	59天			未开工，可控	
01009001007		旋喷桩	494	m	2025/2/10	2025/4/10	59天			未开工，可控	
01009001001		钢支撑	50.9	t	2025/4/30	2025/8/20	112天			未开工，可控	
01009001003		地下连续墙	1195.02	m3	2025/3/21	2025/5/23	63天			未开工，可控	
01009001006		高压旋喷桩（地连墙槽壁加固）	1553.8	m	2025/2/10	2025/4/10	59天			未开工，可控	
01009001002		钢筋混凝土支撑	229.57	m3	2025/5/1	2025/9/4	126天			未开工，可控	
01009001004		三轴搅拌桩（SMW工法桩）	1924.38	m3	2025/3/20	2025/5/10	51天			未开工，可控	
01010		南岸C匝道暗埋			2023/12/30	2024/10/14					
01010002		主体结构混凝土	300	m	2024/4/28	2024/10/14	169天			未开工，可控	
01010001		基坑支护			2023/12/30	2024/6/26					
01010001006		高压旋喷桩（地连墙槽壁加固）	19815.67	m	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01010001005		高压旋喷桩加固	141.4	m	2024/1/17	2024/3/1	44天			未开工，严重滞后	
01010001001		钢支撑	466	t	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01010001003		地下连续墙	6856.85	m3	2024/2/8	2024/4/30	82天			未开工，已超期	延期 50 天
01010001004		高压旋喷桩止水帷幕	283.1	m	2023/12/30	2024/2/29	61天			未开工，严重滞后	
01010001002		钢筋混凝土支撑	597.28	m3	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01015		隧道装修及防水	1	项	2025/12/8	2026/8/14	249天			未开工，可控	
01006		北岸A匝道暗埋			2024/6/22	2024/9/30					
01006001		主体结构混凝土	230	m	2024/6/22	2024/9/30	100天			未开工，可控	
01011		隧道开挖段基底处理			2024/5/28	2025/8/15					
01011006		北岸A匝道暗埋	230	m	2024/6/2	2024/7/21	49天			未开工，可控	
01011002		北岸暗埋段	460	m	2024/6/2	2024/7/21	49天			未开工，可控	
01011008		北岸B匝道暗埋	190	m	2024/6/2	2024/7/21	49天			未开工，可控	
01011003		南岸敞开段	170	m	2024/5/30	2024/6/26	27天			未开工，可控	
01011004		南岸暗埋段	530	m	2025/7/17	2025/8/15	29天			未开工，可控	
01011007		北岸B匝道敞开	120	m	2024/6/1	2024/6/30	29天			未开工，可控	
01011005		北岸A匝道敞开	120	m	2024/6/1	2024/6/30	29天			未开工，可控	
01011010		南岸C匝道暗埋	300	m	2025/7/17	2025/8/15	29天			未开工，可控	
01011001		北岸敞开段	170	m	2024/6/1	2024/6/30	29天			未开工，可控	
01011009		南岸C匝道敞开	120	m	2025/7/17	2025/8/15	29天			未开工，可控	
01003		南岸敞开段			2025/2/10	2025/12/23					
01003002		主体结构混凝土	170	m	2025/7/7	2025/12/23	169天			未开工，可控	
01003001		基坑支护			2025/2/10	2025/9/5					
01003001003		钢筋混凝土支撑	704.34	m3	2025/6/7	2025/9/4	89天			未开工，可控	
01003001005		高压旋喷桩(3x3m范围)	304.2	m	2025/4/16	2025/5/16	30天			未开工，可控	
01003001006		高压旋喷桩止水帷幕	694.66	m	2025/4/16	2025/7/30	105天			未开工，可控	
01003001007		喷射混凝土护坡	169.11	m2	2025/6/8	2025/9/4	88天			未开工，可控	
01003001002		钢支撑	253.15	t	2025/6/7	2025/9/4	89天			未开工，可控	
01003001008		深层水泥搅拌桩（地连墙槽壁加固）	5390.3	m3	2025/2/10	2025/5/30	109天			未开工，可控	
01003001001		钢立柱	48.91	t	2025/2/10	2025/3/8	26天			未开工，可控	
01003001004		地下连续墙	3815.06	m3	2025/3/20	2025/6/30	102天			未开工，可控	
01012		沉管工程			2024/4/17	2025/10/31					
01012002		隧道结构			2024/9/30	2025/10/31					
01012002004		管段主体钢筋制安	210	m	2024/10/13	2025/4/6	175天			未开工，可控	
01012002002	2	预制沉管混凝土	210	m	2024/11/1	2025/7/1	242天			未开工，可控	
01012002005	3	一次舾装	2	节	2025/2/2	2025/7/30	178天			未开工，可控	
01012002003		止水带安装	3	条	2025/3/19	2025/8/15	149天			未开工，可控	
01012002001		管节绞移出坞	2	节	2025/8/27	2025/9/30	34天			未开工，可控	
01012001		土石方工程			2024/4/17	2025/6/22					
01012001002		水下炸礁	133337.22	m3	2024/4/30	2024/10/31	184天			未开工，可控	
01012001001		管段基槽开挖土方	11290.62	m3	2024/4/17	2024/8/30	135天			未开工，可控	
01013		土石方工程			2024/3/29	2025/9/4					
1013001		北岸敞开段（含A匝道围护结构）	290	m	2024/5/3	2024/9/10	130天			未开工，可控	
1013003		南岸敞开段	170	m	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01013006		北岸B匝道暗埋	190	m	2025/4/6	2025/5/19	43天			未开工，可控	
01013004		南岸暗埋段	530	m	2025/6/8	2025/9/4	88天			未开工，可控	
01013008		南岸C匝道暗埋	300	m	2025/5/31	2025/9/4	96天			未开工，可控	
01013002		北岸暗埋段（含A匝道维护结构）	690	m	2024/4/22	2024/7/20	89天			未开工，可控	
01013005		北岸B匝道敞开	120	m	2025/3/6	2025/4/19	44天			未开工，可控	
01013007		南岸C匝道敞开	120	m	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01002		北岸暗埋段（含A匝道维护结构）			2023/12/30	2024/11/7			0.79%		
01002001		基坑支护			2023/12/30	2024/11/7			1.25		
01002001008		地下连续墙	9766.07	m3	2024/1/29	2024/4/24	86天			未开工，已超期	延期 60 天
01002001002		钢支撑、钢围堰	620.28	t	2024/4/22	2024/7/20	89天			未开工，可控	
01002001006		0.8m厚素混凝土连续墙	699.81	m3	2024/1/25	2024/3/25	60天			未开工，严重滞后	
01002001001		钢立柱	1	项	2024/1/11	2024/2/7	27天			未开工，严重滞后	
01002001009		喷射混凝土	5128.05	m2	2024/4/22	2024/7/20	89天			未开工，可控	
01002001003		钢筋混凝土支撑	8885.41	m3	2024/4/20	2024/7/20	91天			未开工，可控	
01002001004		钻孔灌注桩	989.1	m3	2024/1/11	2024/3/14	63天			未开工，严重滞后	
01002001007		钢管桩	1	项	2024/1/30	2024/3/26	56天			未开工，严重滞后	
01002001005		高压旋喷桩（3.5x3.5m范围）	1768.33	m	2023/12/30	2024/2/28	60天			未开工，严重滞后	
01002001010		高压旋喷桩(地连墙槽壁加固)	26889.9	m	2023/12/30	2024/10/1	276天	8400.00 	31.24%	施工中，延期开工，可控	预计提前 145 天
01002002		主体结构混凝土	460	m	2024/5/20	2024/11/7	171天			未开工，可控	
01004		南岸暗埋段			2023/12/30	2024/10/14					
01004001		基坑支护			2023/12/30	2024/6/26					
01004001003		钢筋混凝土支撑	5477.09	m3	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01004001009		地连墙槽壁加固水泥搅拌桩	18770.32	m3	2023/12/30	2024/4/15	107天			未开工，已超期	延期 90 天
01004001004		钻孔灌注桩	1948.06	m3	2023/12/30	2024/4/30	122天			未开工，已超期	延期 90 天
01004001007		地下连续墙	18996.02	m3	2024/2/6	2024/5/30	114天			未开工，已超期	延期 52 天
01004001001		钢立柱	542.09	t	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01004001010		0.8m厚素混凝土连续墙	727.68	m3	2024/2/6	2024/4/30	84天			未开工，已超期	延期 52 天
01004001005		旋喷桩	25683.36	m	2024/1/17	2024/5/30	134天			未开工，已超期	延期 72 天
01004001008		钢管桩	519.91	t	2023/12/30	2024/4/30	122天			未开工，已超期	延期 90 天
01004001002		钢支撑	3181.89	t	2024/3/29	2024/6/26	89天			未开工，已超期	无偏差
01004001006		喷射混凝土	5531.8	m2	2024/3/29	2024/6/15	78天			未开工，已超期	无偏差
01004002		主体结构混凝土	530	m	2024/4/28	2024/10/14	169天			未开工，可控	0%
01005		北岸A匝道敞开			2024/5/5	2024/8/30					0%
01005001		主体结构混凝土	170	m	2024/5/5	2024/8/30	117天			未开工，可控	0%
01007		北岸B匝道敞开			2024/11/18	2025/7/23					0%
01007001		基坑支护			2024/11/18	2025/4/29					0%
01007001005		地下连续墙	2481.92	m3	2024/11/18	2025/2/20	94天			未开工，可控	0%
01007001006		高压旋喷桩止水帷幕	6724.23	m	2024/11/29	2025/2/26	89天			未开工，可控	0%
01007001004		喷射混凝土	292.48	m2	2025/3/6	2025/4/1	26天			未开工，可控	0%
01007001002		钢筋混凝土支撑	191.3	m3	2025/3/13	2025/4/26	44天			未开工，可控	0%
01007001001		钢支撑	80.2	t	2025/2/28	2025/3/30	30天			未开工，可控	0%
01007001003		高压旋喷桩	299.3	m	2024/12/21	2025/2/16	57天			未开工，可控	
01007002		主体结构混凝土	120	m	2025/3/30	2025/7/23	115天			未开工，可控	
01008		北岸B匝道暗埋			2023/12/30	2024/11/15					
01008002		主体结构混凝土	190	m	2024/5/22	2024/11/15	177天			未开工，可控	
01008001		基坑支护			2023/12/30	2024/11/15					
01008001004		高压旋喷桩止水帷幕	475	m	2024/1/11	2024/3/14	63天			未开工，严重滞后	
01008001002		钢筋混凝土支撑	344.58	m3	2024/4/22	2024/7/20	89天			未开工，可控	
01008001003		地下连续墙	5129.26	m3	2024/1/30	2024/3/30	60天			未开工，已超期	延期 59 天
01008001001		钢支撑	535.24	t	2024/4/11	2024/6/30	80天			未开工，可控	
01008001006		高压旋喷桩（地连墙槽壁加固）	10698.33	m	2023/12/30	2024/2/18	50天			未开工，严重滞后	
01008001005		高压旋喷桩加固（3x3m范围）	723.45	m	2023/12/30	2024/3/30	91天			未开工，已超期	延期 90 天
01014	1	干坞			2023/12/30	2024/9/24			20.60%		
01014004		坞底处理（袖阀管注浆）	1	项	2024/8/18	2024/8/30	12天			未开工，可控	
01014001		土方工程	1	项	2024/5/3	2024/9/24	144天			未开工，可控	
01014003		边坡工程（地下连续墙）	2643.31	m3	2024/2/6	2024/7/31	176天	1610	60.91%	施工中，延期开工，可控	预计提前 107 天
01014002		干坞边坡水泥搅拌桩加固	5769	根	2023/12/30	2024/3/10	71天	3020	52.35%	施工中，已超期	延期 19 天
01014005		格栅连续墙			2024/2/19	2024/6/30			39.73%		
01014005001		挡土墙	54.18	m3	2024/4/23	2024/5/2	9天			未开工，可控	
01014005003		高压旋喷桩	140	m	2024/3/22	2024/4/15	24天			未开工，已超期	延期 7 天
01014005002		地下连续墙	6331.9	m3	2024/2/19	2024/6/30	132天	2567	40.54%	施工中，延期开工，可控	预计提前 42 天
03		管理用房	1	项	2025/5/13	2026/5/7	359天			未开工，可控	
05		室外工程（给排水、消防、临电）	1	项	2025/12/8	2026/8/4	239天			未开工，可控	
02		道路及附属工程			2023/12/25	2026/8/14			0.50%		
02006		隧道出入口			2024/12/30	2025/12/30					
02006003		雨棚(A、B、C匝道共3个道口)	3	座	2025/9/30	2025/12/30	91天			未开工，可控	
02006001		雨棚(鸿福西路出入口)	1	座	2024/12/30	2025/3/30	90天			未开工，可控	
02006002		雨棚(银龙路出入口)	1	座	2025/5/30	2025/8/30	92天			未开工，可控	
02007		桩基托换			2023/12/26	2024/12/30					
02007002		桩基托换			2023/12/26	2024/10/30					
02007002003		高压水泥旋喷桩	2028.43	m	2023/12/26	2024/10/30	309天			未开工，已超期	延期 94 天
02007002001		桩基工程			2023/12/26	2024/9/30					
02007002001001		泥浆护壁成孔灌注桩	288	m	2023/12/30	2024/9/30	275天			未开工，已超期	延期 90 天
02007002001002		钢管桩	23	根	2023/12/26	2024/9/30	279天			未开工，已超期	延期 94 天
02007002002		钢筋混凝土支撑	1888.26	m3	2024/5/24	2024/10/20	149天			未开工，可控	
02007001		土石方工程	1	项	2024/5/15	2024/5/26	11天			未开工，可控	
02013		管线迁改			2023/12/30	2025/2/9					
02013002		南岸线管改迁	1	项	2024/2/17	2024/11/27	284天			未开工，已超期	延期 41 天
02013001		北岸线管改迁	1	项	2023/12/30	2025/2/9	407天			未开工，已超期	延期 90 天
02010		保护隔离桩	1	项	2024/4/4	2024/5/18	44天			未开工，可控	
02008		泵站迁移及恢复	1	项	2024/6/1	2024/12/30	212天			未开工，可控	
02005		道路绿化喷灌工程	1	项	2026/6/16	2026/8/14	59天			未开工，可控	
02004		绿化工程	1	项	2026/6/16	2026/8/14	59天			未开工，可控	
02009		人行便桥及滨江体育公园拆除与恢复			2023/12/25	2025/1/10			25.19%		
02009002		滨江体育公园拆迁及人行便桥恢复	1	项	2023/12/25	2025/1/10	382天			未开工，已超期	延期 95 天
02009001		人行便桥拆除与恢复	1	项	2023/12/25	2024/12/30	371天	0.5	50%	施工中，延期开工，可控	预计提前 267 天
02011		道路照明工程	1	项	2025/12/8	2026/2/8	62天			未开工，可控	
02003		交通疏解	1	项	2023/12/25	2026/8/14	963天			未开工，已超期	延期 95 天
02001		道路市政工程	1	项	2024/5/30	2025/5/30	365天			未开工，可控	
02002		交通工程	1	项	2026/6/16	2026/8/14	59天			未开工，可控	
02012		道路监控工程	1	项	2026/3/9	2026/8/4	148天			未开工，可控	
06		护岸工程			2024/2/6	2026/4/22					
06003		堤防修复	1	项	2025/12/15	2026/2/12	59天			未开工，可控	
06001		格栅式地下连续墙支护	38184.25	m	2024/2/6	2024/4/26	80天			未开工，已超期	延期 52 天
06002		防洪墙、防洪堤	1	项	2024/4/17	2024/5/18	31天			未开工，可控	
006005		施工临时工程	1	项	2025/11/26	2026/4/22	147天			未开工，可控	
06004		道路工程	1	项	2026/2/13	2026/3/4	19天			未开工，可控	
04		隧道安装工程（通风、电气、监控、给排水）	1	项	2025/12/8	2026/8/14	249天			未开工，可控	

`;
function transformData(input) {
	const lines = input.trim().split("\n");
	const result = [];
	let beforeLength = lines[0].split("	").length;
	let nearestParent = {};
	for (const line of lines) {
		const parts = line.split("	");
		if (parts.length != beforeLength) {
			console.log(
				"diff-parts,line-parts.length-beforeLength:",
				parts,
				line,
				parts.length,
				beforeLength
			);
			continue;
		}
		let parentId = "";
		if (nearestParent[parts[0].length - 3]) {
			parentId = nearestParent[parts[0].length - 3];
		}
		nearestParent[parts[0].length] = parts[0];
		result.push({
			id: parts[0],
			isKey: parts[1],
			task: parts[2],
			count: parts[3],
			unit: parts[4],
			planStartTime: parts[5],
			planEndTime: parts[6],
			date: parts[7],
			curCount: parts[8],
			rate: parts[9],
			status: parts[10], // You need to set the correct status based on your criteria
			diff: parts[11], // You need to calculate the deviation based on plan and actual time
			parentId: parentId,
		});
	}

	return result;
}

const outputData = transformData(inputData);

const arrToTree = (arr) => {
	let tree = [];
	arr.forEach((e) => {
		e.child = arr.filter((ev) => {
			return e.id == ev.parentId;
		});
		if (!e.parentId) {
			tree.push(e);
		}
	});
	return tree;
};
console.log(outputData, arrToTree(JSON.parse(JSON.stringify(outputData))));

let transformVerriDataInput = `9:00:00	-18
10:00:00	25
11:00:00	87
12:00:00	147
13:00:00	183
14:00:00	174
15:00:00	131
16:00:00	96
17:00:00	67
18:00:00	39
19:00:00	11
20:00:00	11
21:00:00	-23
22:00:00	-26
23:00:00	10
0:00:00	70
1:00:00	106
2:00:00	119
3:00:00	112
4:00:00	95
5:00:00	71
6:00:00	57
7:00:00	39
8:00:00	20
9:00:00	7
`;
function transformDataCommon(input) {
	const lines = input.trim().split("\n");
	const result = [];
	let beforeLength = lines[0].split("	").length;
	for (const line of lines) {
		const parts = line.split("	");
		if (parts.length != beforeLength) {
			console.log(
				"diff-parts,line-parts.length-beforeLength:",
				parts,
				line,
				parts.length,
				beforeLength
			);
			continue;
		}
		result.push({
			name: parts[0],
			value: parts[1],
		});
	}

	return result;
}
transformDataCommon(transformVerriDataInput);
